OF_Sims/planar_Sims/planarPoiseuille_10dT/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            patch;
        nFaces          40;
        startFace       2080;
    }
    right
    {
        type            patch;
        nFaces          40;
        startFace       2120;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       2160;
    }
    centreline
    {
        type            patch;
        nFaces          80;
        startFace       2240;
    }
    frontAndBack
    {
        type            patch;
        nFaces          400;
        startFace       2320;
    }
)

// ************************************************************************* //
